In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
from datetime import datetime as dt
import plotly.express as px


%matplotlib inline

In [2]:
#bringing in Atlanta unemployment rates
atl_unemp = pd.read_excel('../data/atl_unemp_rates.xlsx', header = [10] )
atl_unemp.head()

C:\Users\kogan\anaconda3\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

   Year Period  labor force  employment  unemployment  unemployment rate
0  2018    Jan      3066582     2934687        131895                4.3
1  2018    Feb      3096135     2964472        131663                4.3
2  2018    Mar      3095962     2971805        124157                4.0
3  2018    Apr      3077443     2963741        113702                3.7
4  2018    May      3077063     2963537        113526                3.7

In [3]:
#adding city column
atl_unemp['city'] = 'Atlanta'

#renaming period column to month
atl_unemp = atl_unemp.rename(columns = {'Period':'month'})

#reordering columns
atl_unemp = atl_unemp.loc[:,['Year', 'city', 'month', 'labor force', 'employment', 'unemployment','unemployment rate']]

atl_unemp.head()

,Year,city,month,labor force,employment,unemployment,unemployment rate
0,2018,Atlanta,Jan,3066582,2934687,131895,4.3
1,2018,Atlanta,Feb,3096135,2964472,131663,4.3
2,2018,Atlanta,Mar,3095962,2971805,124157,4.0
3,2018,Atlanta,Apr,3077443,2963741,113702,3.7
4,2018,Atlanta,May,3077063,2963537,113526,3.7

In [4]:
#bringing in Austin unemployment rates
austin_unemp = pd.read_excel('../data/austin_unemp_rate.xlsx', header = [10] )
austin_unemp.head()

C:\Users\kogan\anaconda3\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

   Year Period  labor force  employment  unemployment  unemployment rate
0  2018    Jan      1165547     1129176         36371                3.1
1  2018    Feb      1180218     1143232         36986                3.1
2  2018    Mar      1179867     1143524         36343                3.1
3  2018    Apr      1184966     1152377         32589                2.8
4  2018    May      1183775     1151579         32196                2.7

In [5]:
#adding city column
austin_unemp['city'] = 'Austin'

#renaming period column to month
austin_unemp = austin_unemp.rename(columns = {'Period':'month'})

#reordering columns
austin_unemp = austin_unemp.loc[:,['Year', 'city', 'month', 'labor force', 'employment', 'unemployment','unemployment rate']]

austin_unemp.head()

,Year,city,month,labor force,employment,unemployment,unemployment rate
0,2018,Austin,Jan,1165547,1129176,36371,3.1
1,2018,Austin,Feb,1180218,1143232,36986,3.1
2,2018,Austin,Mar,1179867,1143524,36343,3.1
3,2018,Austin,Apr,1184966,1152377,32589,2.8
4,2018,Austin,May,1183775,1151579,32196,2.7

In [6]:
#bringing in Nashville unemployment rates
nash_unemp = pd.read_excel('../data/nash_unemp_rate.xlsx', header = [10] )
nash_unemp.head()

C:\Users\kogan\anaconda3\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

   Year Period  labor force  employment  unemployment  unemployment rate
0  2018    Jan      1024108      994466         29642                2.9
1  2018    Feb      1035479     1006883         28596                2.8
2  2018    Mar      1039623     1010719         28904                2.8
3  2018    Apr      1041146     1016400         24746                2.4
4  2018    May      1041795     1016665         25130                2.4

In [7]:
#adding city column
nash_unemp['city'] = 'Nashville'

#renaming period column to month
nash_unemp = nash_unemp.rename(columns = {'Period':'month'})

#reordering columns
nash_unemp = nash_unemp.loc[:,['Year', 'city', 'month', 'labor force', 'employment', 'unemployment','unemployment rate']]

nash_unemp.head()

,Year,city,month,labor force,employment,unemployment,unemployment rate
0,2018,Nashville,Jan,1024108,994466,29642,2.9
1,2018,Nashville,Feb,1035479,1006883,28596,2.8
2,2018,Nashville,Mar,1039623,1010719,28904,2.8
3,2018,Nashville,Apr,1041146,1016400,24746,2.4
4,2018,Nashville,May,1041795,1016665,25130,2.4

In [8]:
atl_unemp.to_csv('../data/cleaned/unemp/atl_unemp.csv', index = False)

In [9]:
austin_unemp.to_csv('../data/cleaned/unemp/austin_unemp.csv', index = False)

In [10]:
nash_unemp.to_csv('../data/cleaned/unemp/nash_unemp.csv', index = False)

In [11]:
atl_unemp.head()

,Year,city,month,labor force,employment,unemployment,unemployment rate
0,2018,Atlanta,Jan,3066582,2934687,131895,4.3
1,2018,Atlanta,Feb,3096135,2964472,131663,4.3
2,2018,Atlanta,Mar,3095962,2971805,124157,4.0
3,2018,Atlanta,Apr,3077443,2963741,113702,3.7
4,2018,Atlanta,May,3077063,2963537,113526,3.7

In [12]:
nash_unemp.head()

,Year,city,month,labor force,employment,unemployment,unemployment rate
0,2018,Nashville,Jan,1024108,994466,29642,2.9
1,2018,Nashville,Feb,1035479,1006883,28596,2.8
2,2018,Nashville,Mar,1039623,1010719,28904,2.8
3,2018,Nashville,Apr,1041146,1016400,24746,2.4
4,2018,Nashville,May,1041795,1016665,25130,2.4

In [13]:
austin_unemp.head()

,Year,city,month,labor force,employment,unemployment,unemployment rate
0,2018,Austin,Jan,1165547,1129176,36371,3.1
1,2018,Austin,Feb,1180218,1143232,36986,3.1
2,2018,Austin,Mar,1179867,1143524,36343,3.1
3,2018,Austin,Apr,1184966,1152377,32589,2.8
4,2018,Austin,May,1183775,1151579,32196,2.7

In [16]:
#concatenating all unemployment tables together
unemp = pd.concat([atl_unemp,austin_unemp,nash_unemp])
unemp.head()

,Year,city,month,labor force,employment,unemployment,unemployment rate
0,2018,Atlanta,Jan,3066582,2934687,131895,4.3
1,2018,Atlanta,Feb,3096135,2964472,131663,4.3
2,2018,Atlanta,Mar,3095962,2971805,124157,4.0
3,2018,Atlanta,Apr,3077443,2963741,113702,3.7
4,2018,Atlanta,May,3077063,2963537,113526,3.7

In [18]:
unemp.to_csv('../data/cleaned/unemp/unemp.csv')